import streamlit as st

st.write('# 2023 내신 파헤치기')

st.write('과목, 출판사, 수행평가 비중, 중간/기말고사 여부, 선택자 수(2학년) 확인 가능')

st.write('### 1학년')

import pandas as pd
df = pd.DataFrame({
  '과목': ['국어','수학','영어','한국사','통합사회','통합과학','과학탐구실험','체육','음악','미술','기술 가정','정보'],
  '출판사': ['비상교육(박안)','미래엔','다락원','비상교육','미래엔','비상교육','천재교육','와이비엠','지학사','비상교육','미래엔','이오북스'],
  '수행평가 비중(%)': ['40','40','40','40','50','40','100','100','100','100','40','60'],
  '중간고사 여부': ['O','O','O','O','O','O','X','X','X','X','X','X'],
  '기말고사 여부': ['O','O','O','O','O','O','X','X','X','X','O','O']
  
})

st.write(df)

st.write('### 2학년')

import pandas as pd
df = pd.DataFrame({
  '과목': ['문학','독서','수학Ⅰ','수학Ⅱ','영어Ⅰ','영어Ⅱ','사회문화','경제','생활과 윤리','세계사','세계지리(폐강)','물리학Ⅰ','화학Ⅰ','생명과학Ⅰ','지구과학Ⅰ','운동과 건강','중국어Ⅰ','일본어Ⅰ','한문Ⅰ','확률과 통계','기하','수학과제탐구','여행지리','인공지능기초'],
  '출판사': ['창비','비상교육','천재교과서(류)','미래엔','비상교육','비상교육','비상교육','비상교육','천재교과서','금성출판사','미래엔','천재교육','천재교육','천재교육','천재교육','와이비엠','다락원','엔이능률','금성출판사','천재교과서','미래엔','∅','천재교과서','삼양미디어'],
  '선택자 수(상대평가 과목)': ['270','270','270','270','270','270','96','34','95','47','∅','100','151','169','118','270','68','187','15','179','절대평가','절대평가','절대평가','절대평가'],
  '수행평가 비중(%)': ['40','40','40','40','40','40','40','40','40','40','∅','40','40','40','40','100','50','50','50','40','50','100','50','70'],
  '중간고사 여부': ['O(1학기)','O(2학기)','O(1학기)','O(2학기)','O(1학기)','O(2학기)','O','O','O','O','∅','O','O','O','O','X','X','X','X','O','X','X','X','X'],
  '기말고사 여부': ['O(1학기)','O(2학기)','O(1학기)','O(2학기)','O(1학기)','O(2학기)','O','O','O','O','∅','O','O','O','O','X','O','O','O','O','O','X','O','O']
})

st.write(df)

st.write('### 3학년')

import pandas as pd
df = pd.DataFrame({
  '과목': ['화법과 작문','언어와 매체','미적분','경제 수학','영어 독해와 작문','한국지리','동아시아사(폐강)','윤리와 사상','정치와 법','물리학Ⅱ','화학Ⅱ','생명과학Ⅱ','지구과학Ⅱ','융합과학','사회문제 탐구','스포츠 생활','음악 연주','미술 창작','중국어Ⅱ','일본어Ⅱ','생활과 한문','프로그래밍','공학일반','심리학','논술'],
  '출판사': ['창비','비상교육','천재교과서','한국검인정(광주)','엔이능률','미래엔','비상교육','미래엔','비상교육','천재교육','천재교육','미래엔','천재교육','한국검인정(대구)','한국검인정(전북)','와이비엠','∅','∅','다락원','엔이능률','북스힐','성림출판','충청남도교육청','씨마스','와이비엠'],
  '수행평가 비중(%)': ['40','40','40','50','40','40','∅','40','40','50','50','50','50','50','50','100','100','100','50','50','50','60','100','100','100'],
  '중간고사 여부': ['O','O','O','X','O','O','∅','O','O','X','X','X','X','X','X','X','X','X','X','X','X','X','X','X','X'],
  '기말고사 여부': ['O','O','O','O','O','O','∅','O','O','O','O','O','O','O','O','X','X','X','O','O','O','O','X','X','X']
})

st.write(df)


st.write("2023년 정보임을 꼭 인지해주세요.")
st.write("참고용으로만 사용해주세요. 오류 확인 시 20902 김도현, 20908 김찬을 찾아주세요.")
